Version2/TestTool/TestTool.Setup/Requests/Receiver/ConfigureReceiver/ConfigureReceiver (Short).xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trv="http://www.onvif.org/ver10/receiver/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trv:ConfigureReceiver>
      <trv:ReceiverToken>tokenReceiver1</trv:ReceiverToken>
      <trv:Configuration>
        <trv:Mode>AutoConnect</trv:Mode>
        <trv:MediaUri>Uri1</trv:MediaUri>
        <trv:StreamSetup>
          <trv:Stream>RTP-Unicast</trv:Stream>
          <trv:Transport>
            <trv:Protocol>UDP</trv:Protocol>
          </trv:Transport>
        </trv:StreamSetup>
      </trv:Configuration>
    </trv:ConfigureReceiver>
  </soap:Body>
</soap:Envelope>