Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/Receiver/GetReceiverState/GetReceiverState.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trv="http://www.onvif.org/ver10/receiver/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trv:GetReceiverState>
      <trv:ReceiverToken>tokenReceiver1</trv:ReceiverToken>
    </trv:GetReceiverState>
  </soap:Body>
</soap:Envelope>